//
// Created by dahhw on 13-Mar-23.
//

#include <stdlib.h>

#ifndef SYS3_STRUCTS_H
#define SYS3_STRUCTS_H

/**
 * @brief Структура для представления данных.
 *
 * Эта структура представляет данные с названием компании,
 * названием отдела, статусом прибыли или убытка, значением и указателем
 * на следующие данные в списке.
 */
typedef struct Data {
    char *company; /**< Название компании. */
    char *department; /**< Название отдела. */
    char profitLoss; /**< Статус прибыли или убытка. */
    int value; /**< Сумма прибыль / убытка. */
    struct Data *next; /**< Указатель на следующие данные в списке. */
} Data;

/**
 * @brief Перечисление для представления операций.
 *
 * Это перечисление представляет различные операции,
 * которые можно выполнить с данными компании.
 */
enum {
    ADD_COMPANY = 1, /**< Добавить компанию. */
    MODIFY_COMPANY, /**< Изменить компанию. */
    DEL_COMPANY, /**< Удалить компанию. */
    READ_COMPANY, /**< Вывести информацию о компании. */
    PROFIT_LOSS, /**< Отобразить прибыль / убыток. */
    DISPLAY_ALL, /**< Отобразить всю информацию. */
    EXIT /**< Выйти из программы. */
};


#endif //SYS3_STRUCTS_H
