//
// Created by super on 04.04.23.
//

#ifndef SYS5_SERVER_H
#define SYS5_SERVER_H

/*!
 * @brief Возвращает день недели для заданной даты.
 *
 * @param date Строка, представляющая дату в формате "dd.mm.yyyy".
 * @return int День недели в виде целого числа (0 = воскресенье, 1 = понедельник, ..., 6 = суббота).
 */
int day_of_week(char *date);

/**
 * @brief Основная функция сервера.
 *
 * Создает сокет сервера и прослушивает соединения от клиентов.
 * При принятии соединения получает данные от клиента и проверяет корректность введенной даты.
 * @return Сообщение о корректности введенной даты.
 */
int main();

#endif //SYS5_SERVER_H
