//
// Created by super on 04.04.23.
//

#ifndef SYS5_SERVER_H
#define SYS5_SERVER_H

/*!
 * @brief Записывает логи в файл.
 * @param event Действие.
 */
void writeToLog(char *event);

/*!
 * @brief Закрывает сокет сервера.
 */
void signalHandler();


/*!
 * @brief Таймер, по истечению которого закрывает сокет сервера
 */
void alarmHandler();


/*!
 * @brief Пример использования команд для парсинга аргументов
 */
void printUsage();

/*!
 * @brief Возвращает день недели для заданной даты.
 *
 * @param date Строка, представляющая дату в формате "dd.mm.yyyy".
 * @return int День недели в виде целого числа (0 = воскресенье, 1 = понедельник, ..., 6 = суббота).
 */
int dayOfWeek(char *date);

/**
 * @brief Основная функция сервера.
 *
 * Создает сокет сервера и прослушивает соединения от клиентов.
 * При принятии соединения получает данные от клиента и проверяет корректность введенной даты.
 * @return Сообщение о корректности введенной даты.
 */
int main();

#endif //SYS5_SERVER_H
